meetings/25-11-2015.tex
% Created 2015-11-25 Wed 14:02
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\date{}
\title{Meeting 26-11-2015}
\hypersetup{
 pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.2 (Org mode 8.3beta)}}
\begin{document}

\maketitle

\section{Convolutional networks}
\label{sec-1}

\subsection{Repository:}
\label{sec-1-1}
\begin{itemize}
\item \url{https://github.com/tudelft/deepdrone}
\end{itemize}

\section{Textons}
\label{sec-2}

\subsection{Repositories:}
\label{sec-2-1}
\begin{itemize}
\item \url{https://github.com/tudelft/draug}
\item \url{https://github.com/tudelft/treXton}
\end{itemize}

\subsection{Visualizer}
\label{sec-2-2}

\begin{itemize}
\item Visualizes texton predictions, filtered texton predictions, and SIFT
predictions
\item Additionally, it shows the pictures during flight and the texton histogram
\end{itemize}

\subsection{Ground truth labeler using SIFT}
\label{sec-2-3}

\begin{itemize}
\item Slow but accurate. Creates a .csv file with x, y coordinates
\item Can be used for testing different approaches (fast\_test.py) --
calculates difference between texton predictions and SIFT
\item Could be used also used for training (semi-supervised learning):
Learning with SIFT (and draug), predicting with textons.
\end{itemize}


\subsection{Derotate image based on IMU data (WiFi with libardrone)}
\label{sec-2-4}
\begin{itemize}
\item Not tested with treXton yet
\end{itemize}

\subsection{Other improvements}
\label{sec-2-5}
\begin{itemize}
\item Visualizer can be used live using a webcam
\item Added a Kalman filter
\item Training based on draug / based on ground truth labeler
\item Different classifiers (random forest regression, nearest neighbors,
gradient boosting) and combinations of different classifiers
\item Added tfidf and global standardization to treXton
\end{itemize}


\subsection{Datasets:}
\label{sec-2-6}
\begin{itemize}
\item Cyberzoo (ground truth: SIFT)
\item Playing Mat (ground truth: OptiTrack)
\end{itemize}

\section{{\bfseries\sffamily TODO} }
\label{sec-3}
\begin{itemize}
\item Clean up code
\item Add global configuration file
\item Test treXton with derotator
\item Hyperparameter optimization (for example, number of decisions trees
or number of textons) and choice of classifiers. Automate that using fast\_test.py
\item Add color to textons (see paper: \emph{Color Textons for Texture
Recognition})
\end{itemize}
% Emacs 24.3.2 (Org mode 8.3beta)
\end{document}
